sterentev/atdf-device-asm-include/inc/ATtiny87.inc
; ----------	Register LINSIR bits		------------------------
.equ	LIDST_MASK	= 0xE0		;      - Identifier Status bits (3 bits)
.equ	LIDST0		= 5		;          LIDST BIT0 position
.equ	LBUSY		= 4		; 0x10 - Busy Signal
.equ	LERR		= 3		; 0x08 - Error Interrupt
.equ	LIDOK		= 2		; 0x04 - Identifier Interrupt
.equ	LTXOK		= 1		; 0x02 - Transmit Performed Interrupt
.equ	LRXOK		= 0		; 0x01 - Receive Performed Interrupt

; ----------	Register LINENIR bits		------------------------
.equ	LENERR		= 3		; 0x08 - Enable Error Interrupt
.equ	LENIDOK		= 2		; 0x04 - Enable Identifier Interrupt
.equ	LENTXOK		= 1		; 0x02 - Enable Transmit Performed Interrupt
.equ	LENRXOK		= 0		; 0x01 - Enable Receive Performed Interrupt

; ----------	Register LINERR bits		------------------------
.equ	LABORT		= 7		; 0x80 - Abort Flag
.equ	LTOERR		= 6		; 0x40 - Frame Time Out Error Flag
.equ	LOVERR		= 5		; 0x20 - Overrun Error Flag
.equ	LFERR		= 4		; 0x10 - Framing Error Flag
.equ	LSERR		= 3		; 0x08 - Synchronization Error Flag
.equ	LPERR		= 2		; 0x04 - Parity Error Flag
.equ	LCERR		= 1		; 0x02 - Checksum Error Flag
.equ	LBERR		= 0		; 0x01 - Bit Error Flag

; ----------	Register LINBTR bits		------------------------
.equ	LDISR		= 7		; 0x80 - Disable Bit Timing Resynchronization
.equ	LBT_MASK	= 0x3F		;      - LIN Bit Timing bits (6 bits)
.equ	LBT0		= 0		;          LBT BIT0 position

; ----------	Register LINBRRL bits		------------------------
.equ	LINBRRL_LDIV_MASK= 0xFF		;      -  (8 bits)
.equ	LINBRRL_LDIV0	= 0		;          LINBRRL_LDIV BIT0 position

; ----------	Register LINBRRH bits		------------------------
.equ	LINBRRH_LDIV_MASK= 0x0F		;      -  (4 bits)
.equ	LINBRRH_LDIV0	= 0		;          LINBRRH_LDIV BIT0 position

; ----------	Register LINDLR bits		------------------------
.equ	LTXDL_MASK	= 0xF0		;      - LIN Transmit Data Length bits (4 bits)
.equ	LTXDL0		= 4		;          LTXDL BIT0 position
.equ	LRXDL_MASK	= 0x0F		;      - LIN Receive Data Length bits (4 bits)
.equ	LRXDL0		= 0		;          LRXDL BIT0 position

; ----------	Register LINIDR bits		------------------------
.equ	LP_MASK		= 0xC0		;      - Parity bits (2 bits)
.equ	LP0		= 6		;          LP BIT0 position
.equ	LID_MASK	= 0x3F		;      - Identifier bit 5 or Data Length bits (6 bits)
.equ	LID0		= 0		;          LID BIT0 position

; ----------	Register LINSEL bits		------------------------
.equ	LAINC		= 3		; 0x08 - Auto Increment of Data Buffer Index (Active Low)
.equ	LINDX_MASK	= 0x07		;      - FIFO LIN Data Buffer Index bits (3 bits)
.equ	LINDX0		= 0		;          LINDX BIT0 position

; ----------	Register LINDAT bits		------------------------
.equ	LDATA_MASK	= 0xFF		;      -  (8 bits)
.equ	LDATA0		= 0		;          LDATA BIT0 position



; ====	USI MODULE REGISTERS BITS DEFINITION		========
;
; ----------	Register USISR bits		------------------------
.equ	USISIF		= 7		; 0x80 - Start Condition Interrupt Flag
.equ	USIOIF		= 6		; 0x40 - Counter Overflow Interrupt Flag
.equ	USIPF		= 5		; 0x20 - Stop Condition Flag
.equ	USIDC		= 4		; 0x10 - Data Output Collision
.equ	USICNT_MASK	= 0x0F		;      - USI Counter Value Bits (4 bits)
.equ	USICNT0		= 0		;          USICNT BIT0 position

; ----------	Register USICR bits		------------------------
.equ	USISIE		= 7		; 0x80 - Start Condition Interrupt Enable
.equ	USIOIE		= 6		; 0x40 - Counter Overflow Interrupt Enable
.equ	USIWM_MASK	= 0x30		;      - USI Wire Mode Bits (2 bits)
.equ	USIWM0		= 4		;          USIWM BIT0 position
.equ	USICS_MASK	= 0x0C		;      - USI Clock Source Select Bits (2 bits)
.equ	USICS0		= 2		;          USICS BIT0 position
.equ	USICLK		= 1		; 0x02 - Clock Strobe
.equ	USITC		= 0		; 0x01 - Toggle Clock Port Pin
; ::::  USIWM	:::: bitfield values
;			0x00		; Normal Operation
;			0x10		; Three-Wire Mode
;			0x20		; Two-Wire Mode
;			0x30		; Two-Wire Mode Held Low



; ====	TC8_ASYNC MODULE REGISTERS BITS DEFINITION	========
;
; ----------	Register TIMSK0 bits		------------------------
.equ	OCIE0A		= 1		; 0x02 - Timer/Counter0 Output Compare Match A Interrupt Enable
.equ	TOIE0		= 0		; 0x01 - Timer/Counter0 Overflow Interrupt Enable

; ----------	Register TIFR0 bits		------------------------
.equ	OCF0A		= 1		; 0x02 - Output Compare Flag 0A
.equ	TOV0		= 0		; 0x01 - Timer/Counter0 Overflow Flag

; ----------	Register TCCR0A bits		------------------------
.equ	COM0A_MASK	= 0xC0		;      - Compare Output Mode bits (2 bits)
.equ	COM0A0		= 6		;          COM0A BIT0 position
.equ	WGM0_MASK	= 0x03		;      - Waveform Generation Mode bits (2 bits)
.equ	WGM00		= 0		;          WGM0 BIT0 position

; ----------	Register TCCR0B bits		------------------------
.equ	FOC0A		= 7		; 0x80 - Force Output Compare A
.equ	CS0_MASK	= 0x07		;      - Clock Select bits (3 bits)
.equ	CS00		= 0		;          CS0 BIT0 position
; ::::  CS0	:::: bitfield values
;			0x00		; No Clock Source (Stopped)
;			0x01		; Running, No Prescaling
;			0x02		; Running, CLK/8
;			0x03		; Running, CLK/32
;			0x04		; Running, CLK/64
;			0x05		; Running, CLK/128
;			0x06		; Running, CLK/256
;			0x07		; Running, CLK/1024

; ----------	Register ASSR bits		------------------------
.equ	EXCLK		= 6		; 0x40 - Enable External Clock Input
.equ	AS0		= 5		; 0x20 - Asynchronous Timer/Counter0
.equ	TCN0UB		= 4		; 0x10 - Timer/Counter0 Update Busy
.equ	OCR0AUB		= 3		; 0x08 - Output Compare Register 0A  Update Busy
.equ	TCR0AUB		= 1		; 0x02 - Timer/Counter0 Control Register A Update Busy
.equ	TCR0BUB		= 0		; 0x01 - Timer/Counter0 Control Register B Update Busy

; ----------	Register GTCCR bits		------------------------
.equ	TSM		= 7		; 0x80 - Timer/Counter Synchronization Mode
.equ	PSR0		= 1		; 0x02 - Prescaler Reset Asynchronous 8-bit Timer/Counter0
.equ	PSR1		= 0		; 0x01 - Prescaler Reset Synchronous 16-bit Timer/Counter1



; ====	TC16 MODULE REGISTERS BITS DEFINITION		========
;
; ----------	Register TIMSK1 bits		------------------------
.equ	ICIE1		= 5		; 0x20 - Timer/Counter1 Input Capture Interrupt Enable
.equ	OCIE1B		= 2		; 0x04 - Timer/Counter1 Output Compare B Match Interrupt Enable
.equ	OCIE1A		= 1		; 0x02 - Timer/Counter1 Output Compare A Match Interrupt Enable
.equ	TOIE1		= 0		; 0x01 - Timer/Counter1 Overflow Interrupt Enable

